
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY_PREVIEW[0]
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.prl-citizen-frontend-session-storage.azurerm_redis_cache.redis
* Replace
  * azurerm_application_insights.appinsights_preview[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights_preview[0] must be replaced
-/+ resource "azurerm_application_insights" "appinsights_preview" {
      ~ app_id                                = "7f575014-2c9f-4776-96c4-9efacd729300" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.Insights/components/prl-appinsights-preview" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "westeurope" -> "uksouth" # forces replacement
        name                                  = "prl-appinsights-preview"
      ~ tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git" -> null
            "application"         = "family-private-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY_PREVIEW[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "AZURE_APPINSIGHTS_KEY_PREVIEW" {
        id                      = "https://prl-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey-Preview/d61402c9d32f4d8f8d21b99ea7acc060"
        name                    = "AppInsightsInstrumentationKey-Preview"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.KeyVault/vaults/prl-aat|prl-aat"
        name                           = "prl-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.prl-citizen-frontend-session-storage.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-citizen-frontend-redis-cache-aat/providers/Microsoft.Cache/redis/prl-citizen-frontend-redis-aat"
        name                          = "prl-citizen-frontend-redis-aat"
        tags                          = {
            "application"         = "family-private-law"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
        # (21 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved = 125 -> 642
          ~ maxmemory_delta                 = 125 -> 642
          ~ maxmemory_reserved              = 125 -> 642
            # (7 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":32,"Program":"tfcmt","SHA1":"","Vars":{}} -->